Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportCreateRebarSet(Tekla.Structures.ModelInternal.dotRebarSet_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotLegFace_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotGuideline_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingZone_t}@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportModifyRebarSet(Tekla.Structures.ModelInternal.dotRebarSet_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotLegFace_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotGuideline_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingZone_t}@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportSelectRebarSet(Tekla.Structures.ModelInternal.dotRebarSet_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotLegFace_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotGuideline_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingZone_t}@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportCreateRebarPropertyStrip(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportModifyRebarPropertyStrip(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateSynchronized.ExportSelectRebarPropertyStrip(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportCreateRebarSet(Tekla.Structures.ModelInternal.dotRebarSet_t@,Tekla.Structures.ModelInternal.dotLegFace_t*,Tekla.Structures.ModelInternal.dotGuideline_t*,Tekla.Structures.ModelInternal.dotContourPoint_t*,Tekla.Structures.ModelInternal.dotSpacingZone_t*)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportModifyRebarSet(Tekla.Structures.ModelInternal.dotRebarSet_t@,Tekla.Structures.ModelInternal.dotLegFace_t*,Tekla.Structures.ModelInternal.dotGuideline_t*,Tekla.Structures.ModelInternal.dotContourPoint_t*,Tekla.Structures.ModelInternal.dotSpacingZone_t*)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportSelectRebarSet(Tekla.Structures.ModelInternal.dotRebarSet_t@,Tekla.Structures.ModelInternal.dotLegFace_t*@,Tekla.Structures.ModelInternal.dotGuideline_t*@,Tekla.Structures.ModelInternal.dotContourPoint_t*@,Tekla.Structures.ModelInternal.dotSpacingZone_t*@)


Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportCreateRebarPropertyStrip(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportModifyRebarPropertyStrip(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.CDelegateSynchronized.dotExportSelectRebarPropertyStrip(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@)
DO NOT USE! For internal usage only.
pStrip: The strip.
Returns: 1 if successful; otherwise 0.